{
  "banner": {
    "title": "Hello, I'm Rémi Dubus. I'm ",
    "job": "web developer.",
    "bannerAlt": "animate picture of constellation."
  },
  "navbar": {
    "about": "About",
    "aboutLink": "/#about",
    "projects": "My projects",
    "projectsLink": "/#projects",
    "contact": "Contact",
    "contactLink": "/#contact"
  },
  "languageButton": {
    "flagAlt": "french flag."
  },
  "link": {
    "linkedinAlt": "Logo of Linkedin.",
    "linkedinLink": "https://www.linkedin.com/in/r-dubus/",
    "gitHubAlt": "Logo of GitHub.",
    "gitHubLink": "https://github.com/Remi-Dubus"
  },
  "about": {
    "aboutTitle": "About me",
    "aboutTextPart1": "After nine years in the baking world, I decided to change direction, mainly because of the working conditions.",
    "aboutTextPart2": "In order to reorient myself, I chose web development, a field that had interested me for a long time and which allowed me to remain in an environment where a product is shaped, just like baking.",
    "aboutTextPart3": "I completed a training program at the Wild Code School, where I learned solid foundations in web development, along with best practices for clean and collaborative coding.",
    "aboutTextPart4": "Since then, I’ve continued to practice regularly, to learn, and to experiment. Naturally curious, I enjoy discovering new technologies, taking on challenges, and improving a little more each day.",
    "aboutTextPart5": "Outside of development, I’m passionate about science, especially astronomy, which I explore through reading specialized journals. I occasionally draw, and I'm a fan of video games for their rich and immersive worlds."
  },
  "skills": {
    "skillsTitle": "Skills"
  },
  "projects": {
    "croustiEatName": "Crousti Eat",
    "croustiEatResume": "First project completed after one month of training.",
    "croustiEatText": "Crousti Eat is the very first project I developed after only one month of training. The goal was to build a responsive web interface allowing users to search for restaurants in the Bordeaux area using various filters (type of cuisine, location, etc.). Fully built with HTML, CSS, and Vanilla JavaScript, this project helped me practice core concepts such as DOM manipulation, event handling, and responsive layout, all without using any external frameworks or libraries.",
    "croustiEatLink": "https://crousti-eat-project.vercel.app/",
    "croustiEatGitHub": "https://github.com/Remi-Dubus/Crousti_Eat",
    "croustiEatTechno": ["html", "css", "javascript"],

    "buyAPlanetName": "Buy A Planet",
    "buyAPlanetResume": "My first React project.",
    "buyAPlanetText": "Buy A Planet is a fictional website for selling planets from the solar system, developed as part of my training. It was my first project using React, designed to introduce me to the logic of dynamic components. The site allows users to view each planet along with its characteristics, within a responsive interface.",
    "buyAPlanetLink": "https://buy-a-planet-project.vercel.app/",
    "buyAPlanetGitHub": "https://github.com/Remi-Dubus/Buy_a_Planet",
    "buyAPlanetTechno": ["typescript", "tailwind", "react"],

    "eShopName": "EShop",
    "eShopResume": "Project developed during training to deepen knowledge of React and state management.",
    "eShopText": "eShop is an e-commerce project built with React during my training. The main focus was on data fetching using fetch(), state management, and designing a clean UI. This project allowed me to strengthen my skills with React and API integration.",
    "eShopLink": "https://eshop-remi-dubus.vercel.app/",
    "eShopGitHub": "https://github.com/Remi-Dubus/Eshop",
    "eShopTechno": ["typescript", "tailwind", "react"],

    "boarderLineName": "Boarder Line",
    "boarderLineResume": "Group project developed using the training center's educational framework.",
    "boarderLineText": "Boarder Line is a group project completed during my training. We designed a website that allows users to browse board games by consuming an external REST API. This project helped me deepen my knowledge of React, particularly data fetching with fetch(), state management using useState and useEffect, as well as collaborative project organization with Git. The interface features a responsive design, navigation through different game categories, a favorites system, and detailed pages for each game.",
    "boarderLineLink": "https://boarder-line-project.vercel.app/",
    "boarderLineGitHub": "https://github.com/Remi-Dubus/Boarder_Line",
    "boarderLineTechno": ["typescript", "css module", "react"],

    "portFolioName": "My first PortFolio",
    "portFolioResume": "My first portfolio, developed with React during my training.",
    "portFolioText": "This portfolio is the first version of my personal website. It showcased my projects and skills with a simple and effective design. I later completely rebuilt it using Next.js, improving the style, performance, and adding new features for a better user experience.",
    "portFolioLink": "https://portfolio-remi-dubus.vercel.app/",
    "portFolioGitHub": "https://github.com/Remi-Dubus/Portfolio",
    "portFolioTechno": ["typescript", "tailwind", "react"],

    "geocodeName": "Geocode",
    "geocodeResume": "Group project presented during the final certification exam.",
    "geocodeText": "GeoCode is a collaborative platform designed to simplify the management and location of charging stations for electric vehicle users. Developed as a team project during my training, it helped me gain hands-on experience with backend development using Express.js combined with a MySQL database. I learned how to build secure RESTful APIs, handle CRUD operations, and manage server-database communication in a real-world environment.",
    "geocodeLink": "#",
    "geocodeGitHub": "https://github.com/Remi-Dubus/Geocode",
    "geocodeTechno": ["typescript", "tailwind", "react", "node", "express", "JWT", "mysql"],

    "fournilExpressName": "Fournil Express",
    "fournilExpressResume": "A personal project, the first one built with Next.js.",
    "fournilExpressText": "Fournil Express is a personal website and my first project built with Next.js. It facilitates the connection between restaurant and bakery professionals to simplify product order management. This project allowed me to discover the fundamentals of Next.js as well as work with a PostgreSQL database.",
    "fournilExpressLink": "https://fournil-express.vercel.app/",
    "fournilExpressGitHub": "https://github.com/Remi-Dubus/Fournil_express",
    "fournilExpressTechno": ["typescript", "tailwind", "next", "JWT", "postgresql"]
  },
  "contact": {
    "contactTitle": "Send me a message!",
    "contactName": "Your name",
    "contactMail": "Your email adress",
    "contactMessage": "Your message",
    "contactButton": "Send",
    "contactSuccess": "Message sent successfully.",
    "contactError": "Fail to send message."
  },
  "errorMessage": {
    "required": "This field is required.",
    "text": "Invalid characters.",
    "email": "Invalid email.",
    "minCharName": "Minimum of 3 characters required.",
    "minCharEmail": "Minimum of 7 characters required.",
    "minCharText": "Minimum of 50 characters required.",
    "maxChar": "Too many characters."
  },
  "footer": {
    "freepikText": "Pictures designed by ",
    "freepikLink": "rawpixel.com / Freepik",
    "simpleIconsText": "Icons designed by ",
    "simpleIconsLink": "Simple Icons"
  }
}